# DegFromStr

## Description
Converts slope from string format to degrees.

```pascal
FUNCTION DegFromStr(
				fSlopeDef   : STRING;
				fSlopeValue : STRING;
				VAR fAngle  : REAL): BOOLEAN;
```

```python
def vs.DegFromStr(fSlopeDef, fSlopeValue):
    return (BOOLEAN, fAngle)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fSlopeDef|STRING|   |
|fSlopeValue|STRING|   |
|fAngle|REAL|   |

## Version
Availability: from Vectorworks 2016

## Category
* SiteModel Interface Library